Hello @ctvedt, can you please share which provider version you are using in this test and is it with the published module of lan_vpn?
Below is the configuration from your example with 0.7.1 provider version, no issues seen with the tracker:

```
- Using previously-installed hashicorp/local v2.5.3
- Using previously-installed ciscodevnet/sdwan v0.7.1
- Using previously-installed netascode/utils v1.0.2
```

```yaml
    service_profiles:
      - name: service_profile1
        description: Example Service Profile 
        ipv4_trackers:
          - name: tracker1
            description: Example IPv4 Tracker
            endpoint_ip: 10.20.0.1
            tracker_name: tracker1
        lan_vpns:
          - vpn_id: 100
            name: VPN_100
            ipv4_static_routes:
              - network_address: 10.20.0.0
                subnet_mask: 255.255.0.0
                gateway: nexthop
                next_hops_with_tracker:
                  - address: 10.20.0.1
                    administrative_distance: 1
                    tracker: tracker1
```

```hcl
  # module.sdwan.sdwan_service_lan_vpn_feature.service_lan_vpn_feature["service_profile1-VPN_100"] will be created
  + resource "sdwan_service_lan_vpn_feature" "service_lan_vpn_feature" {
      + feature_profile_id = (known after apply)
      + id                 = (known after apply)
      + ipv4_static_routes = [
          + {
              + gateway                = "nextHop"
              + network_address        = "10.20.0.0"
              + next_hop_with_trackers = [
                  + {
                      + address                 = "10.20.0.1"
                      + administrative_distance = 1
                      + tracker_id              = (known after apply)
                    },
                ]
              + subnet_mask            = "255.255.0.0"
            },
        ]
      + name               = "VPN_100"
      + version            = (known after apply)
      + vpn                = 100
    }
```

resource created:

```hcl
# module.sdwan.sdwan_service_lan_vpn_feature.service_lan_vpn_feature["service_profile1-VPN_100"]:
resource "sdwan_service_lan_vpn_feature" "service_lan_vpn_feature" {
    feature_profile_id = "2bb08eb4-e0b7-43cf-81b0-4600f9dc1cd1"
    id                 = "080d3183-7b9c-4387-8933-759b3b5af541"
    ipv4_static_routes = [
        {
            gateway                = "nextHop"
            network_address        = "10.20.0.0"
            next_hop_with_trackers = [
                {
                    address                 = "10.20.0.1"
                    administrative_distance = 1
                    tracker_id              = "c34c8eec-4f3b-491e-8050-68e00cb010c2"
                },
            ]
            subnet_mask            = "255.255.0.0"
        },
    ]
    name               = "VPN_100"
    version            = 0
    vpn                = 100
}
```
 